{
  "title": "Finding Hope and Light: My Immigration Journey",
  "content": "The stories of immigrants take on many forms, often carrying resilience and hope. My story, and my parents’ second immigration journey, began in the early 80s with a move from the United Kingdom to the United States. My parents moved to the U.K. from Sri Lanka in 1978 after receiving scholarships to pursue graduate degrees there. After graduation, they lived in London with my mom’s siblings, working odd jobs in the cinema and on the manufacturing line to support their eventual move to the United States.\nI was born in London. The nurses in the hospital brought my mom a baby from the nursery—the wrong baby, and the only other brown baby in the ward at that time. My mom immediately knew and spoke up that the baby wasn’t hers. The lesson I’ve never forgotten from that story is how my mom has always had to be on guard, even during such a vulnerable time. Racism and xenophobia were—and are—always present.\nIt was my mom’s dream to move to the United States. Maybe it was the dream of promises coming true, or the thought of a new life. When she was just a teenager, my mom and her siblings lost their parents. With extreme loss not far in the rearview mirror, and the threat of civil war starting in their homeland, starting the next chapter in a new place seemed like a great option.\nSoon after I was born, my parents left behind the apartment they shared with my aunt and her friend, where together they collected money in a jar to feed a coin-operated radiator to make sure it would continue to run. We headed for the expansiveness of Lincoln, Nebraska, where my dad would continue his postgraduate work, and my mom would also work. There, my parents would find community among other immigrants, from fellow Sri Lankans to Taiwanese to Afghans. Ours was a shared experience, no matter what the country of origin. I could feel that, even at my young age.\nHowever, through the years, we’ve experienced countless acts of xenophobia and racism, including being stopped and interrogated at the Canadian border for no reason but our race, having our bags and my hair checked consistently in airport security lines, and seeing my parents spoken down to because of their accents, even though they learned English at the same time as their mother tongue of Sinhalese. We’ve experienced the fear of losing our green cards, watched family members go through decades of separation because of visa issues, watched from afar as family members in Sri Lanka lived in extreme fear and danger throughout the country’s 30-year civil war, and lost a dear loved one because of the lack of appropriate medical coverage due to the five-year bar on Medicaid shortly after he moved to the United States to be with his family.\nThrough it all, we manage to find hope and light. Perhaps it’s the shared struggle and sense of community that makes the search easier. My family and loved ones certainly see hope and possibility through us—their children, and their grandchildren. Within my large extended family and community, we are all quick to find a way forward in most situations. For that, I’m proud to call myself an immigrant and a Sri Lankan-American.",
  "author": "Isha Weerasinghe",
  "images": [
    "https://www.clasp.org/wp-content/uploads/2022/04/LAJ_3069-400x400.jpg"
  ],
  "source": "https://www.clasp.org/blog/finding-hope-and-light-my-immigration-journey/",
  "slug": "isha_weerasinghe"
}
