{
  "title": "Letter to My Younger Self",
  "content": "Letter to a 14-year-old Maria Concepción Vázquez, when leaving central Mexico in 1962:\nDear younger self,\nI know you are afraid of leaving your hometown in Michoacán, México to emigrate to the United States. Even though you are coming with your mother, you still feel worried, but there are a lot of things you are going to experience—some good, some bad.\nYou will sometimes be very timid and at the same time very brave.\nYou will arrive with your mother in DePue, Illinois, a small town about one hundred miles west of Chicago. You’ll live with your aunt and her family. You’ll be forced to go to school, even though you don’t want to. The first day you attend school, you will feel very strange and out of place. You will feel embarrassed for having to sit there not understanding anything that is going on. You’ll have to depend on a boy to be your interpreter with your teacher for everything you need in the classroom.\nThe only class you will like is math because you’ll know how to do that. And you’ll like when the teacher calls you by her desk half an hour each day to read with you the Spanish and English book titled El Camino Real because it’s bilingual. These experiences will help you progress.\nShortly after you arrive in the United States, your mother will need to go to Chicago to work as a babysitter because she’s in need of money, and it will be hard for her to leave you, the youngest of her six living children. Even though your mother looks fearless, you will come to understand that she is also afraid of going into a large city.\nOne day, when you are a mother to four of your own children, you will realize your mother’s bravery when she left you behind without crying. She will only be able to leave without any tears because of the strength that she will instill in you. You’ll only be able to imagine the heartbreak she felt when she was separated from her youngest daughter, her baby.\nBut one day, you will feel your heart break when your daughter is diagnosed with cancer and when you almost lose your sons to situations out of your control. They will all survive.\nAfter a year of living without your mother, you’ll be reunited. You will travel to Chicago, to a new city, to live with a new family that is much kinder, to a new school, to whole new life.\nBy that point, you will be ready to face anything that you have to—whatever it is. You will be very happy with your mother.\nWhen you are almost nineteen, you will marry a very hard working man. Before you have children, he will take you out dancing many times. One of your favorite memories will be dancing with him on New Year’s Eve in 1968 at Chicago’s Aragon Ballroom as Carlos Campos and his orchestra plays. You’ll spend the rest of your lives together. You will care for him with lots of love when he gets old and sick.\nWhen your children are in elementary school, you will work there—helping other immigrant children who arrive in the country without speaking English. These children will tell you they are very grateful for you.\nYou will be involved in your children’s lives at softball games, Boy Scout events, school fundraisers, the school board. You will interpret for many people who don’t speak English. You will become an American citizen.\nYou will continue to work, raise a family, take some classes in college.\nYou will use the strength to overcome unimaginable challenges personally and financially. With lots of sacrifice, you will pay off your home.\nYou will raise your children to be as strong as possible. Your eldest son will go to college and be what you wanted to be—a teacher. He will encourage you to write.\nYour children and their children will remain a part of your life. They will tell you that, in their eyes, you are the strongest woman in the world.\nWhen you retire after working very hard for many years, you will not ask for anything else: you will reach all your goals. You will remember your mother often and be thankful for her good example and for teaching you how to survive.",
  "author": "Tony Hernandez / Maria Concepción Vázquez",
  "images": [
    "https://immigrantarchiveproject.org/wp-content/uploads/2020/06/Maria-Concepcio%CC%81n-Va%CC%81zquez-720x550.jpeg"
  ],
  "source": "https://immigrantarchiveproject.org/letter-younger-self/",
  "slug": "maria_concepcion_vazquez"
}
